---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationParallel
source: html/fd047013-d138-f467-7bd5-6bdfb18099f0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailFilletCreationParallel Property

Cannot create specified fillet at rail path corner because of the curves are already smoothed.

## Syntax (C#)
```csharp
public static FailureDefinitionId ContinuousRailFilletCreationParallel { get; }
```